# Определить сколько различных чисел в списке

list_1 = [1, 1, 0, -1, 3, 4, 4]
set_1 = set(list_1)
print(len(set_1))